In [2]:
# basic imports 
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

# Getting the data ready
from sklearn.model_selection import train_test_split, cross_val_score
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import OneHotEncoder
from sklearn.impute import SimpleImputer

# Import Regression Models
from sklearn.ensemble import RandomForestRegressor
from sklearn.preprocessing import StandardScaler

# Evaluation and tuning models
from sklearn.metrics import mean_squared_error, mean_absolute_error, r2_score

In [3]:
data = pd.read_csv('Finance.csv')
data.head()

,SBU,DEPARTMENT,SUB DEPT.,SR #,EMP ID,EMPLOYEE NAME,EMP TYPE,SALARY,DAY WORK,EARND AMT,S.SEC AMT
0,C.M.T.,ACCOUNTS,GENERAL STAFF,1,111010005,MOHAMMAD ZAHID,Permanent,"28,500",31,"28,500",350
1,C.M.T.,ACCOUNTS,GENERAL STAFF,2,222160527,AQEEL ANWAR KHAN,Permanent,"14,000",31,"14,000",350
2,C.M.T.,ACCOUNTS,GENERAL STAFF,3,222161077,WASIF SADDIQUE,Permanent,"4,600",31,"4,600",322
3,C.M.T.,ACCOUNTS,GENERAL STAFF,4,661040006,ARSHID ALI,Permanent,"7,500",31,"7,500",350
4,C.M.T.,ADMIN,GENERAL STAFF,5,200501023,SAKHAWAT ALI,Permanent,"4,200",30,"4,064",284

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1729 entries, 0 to 1728
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   SBU            1727 non-null   object
 1   DEPARTMENT     1727 non-null   object
 2   SUB DEPT.      1727 non-null   object
 3   SR #           1727 non-null   object
 4   EMP ID         1727 non-null   object
 5   EMPLOYEE NAME  1727 non-null   object
 6   EMP TYPE       1727 non-null   object
 7    SALARY        1728 non-null   object
 8    DAY WORK      1728 non-null   object
 9    EARND AMT     1728 non-null   object
 10   S.SEC AMT     1728 non-null   object
dtypes: object(11)
memory usage: 148.7+ KB

In [5]:
data.dtypes

SBU              object
DEPARTMENT       object
SUB DEPT.        object
SR #             object
EMP ID           object
EMPLOYEE NAME    object
EMP TYPE         object
 SALARY          object
 DAY WORK        object
 EARND AMT       object
 S.SEC AMT       object
dtype: object

In [6]:
data = pd.read_csv('bank.csv')
data.tail()

     age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"
4516  33;"services";"married";"secondary";"no";-333;...
4517  57;"self-employed";"married";"tertiary";"yes";...
4518  57;"technician";"married";"secondary";"no";295...
4519  28;"blue-collar";"married";"secondary";"no";11...
4520  44;"entrepreneur";"single";"tertiary";"no";113...

In [7]:
data.dtypes

age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"    object
dtype: object

In [8]:
data.corr()

Empty DataFrame
Columns: []
Index: []

In [9]:
data.columns

Index(['age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"'], dtype='object')

In [10]:
data.info

<bound method DataFrame.info of      age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"
0     30;"unemployed";"married";"primary";"no";1787;...
1     33;"services";"married";"secondary";"no";4789;...
2     35;"management";"single";"tertiary";"no";1350;...
3     30;"management";"married";"tertiary";"no";1476...
4     59;"blue-collar";"married";"secondary";"no";0;...
...                                                 ...
4516  33;"services";"married";"secondary";"no";-333;...
4517  57;"self-employed";"married";"tertiary";"yes";...
4518  57;"technician";"married";"secondary";"no";295...
4519  28;"blue-collar";"married";"secondary";"no";11...
4520  44;"entrepreneur";"single";"tertiary";"no";113...

[4521 rows x 1 columns]>

In [11]:
data = pd.read_csv('bank-additional.csv')

In [12]:
data.head()

  age;"job";"marital";"education";"default";"housing";"loan";"contact";"month";"day_of_week";"duration";"campaign";"pdays";"previous";"poutcome";"emp.var.rate";"cons.price.idx";"cons.conf.idx";"euribor3m";"nr.employed";"y"
0  30;"blue-collar";"married";"basic.9y";"no";"ye...
1  39;"services";"single";"high.school";"no";"no"...
2  25;"services";"married";"high.school";"no";"ye...
3  38;"services";"married";"basic.9y";"no";"unkno...
4  47;"admin.";"married";"university.degree";"no"...